SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prbs.h
/** @} End of group EFR32FG25_PRBS */

/**************************************************************************//**
 * @addtogroup EFR32FG25_PRBS
 * @{
 * @defgroup EFR32FG25_PRBS_BitFields PRBS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for PRBS IPVERSION */
#define _PRBS_IPVERSION_RESETVALUE           0x00000001UL                               /**< Default value for PRBS_IPVERSION            */
#define _PRBS_IPVERSION_MASK                 0xFFFFFFFFUL                               /**< Mask for PRBS_IPVERSION                     */
#define _PRBS_IPVERSION_IPVERSION_SHIFT      0                                          /**< Shift value for PRBS_IPVERSION              */
#define _PRBS_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                               /**< Bit mask for PRBS_IPVERSION                 */
#define _PRBS_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                               /**< Mode DEFAULT for PRBS_IPVERSION             */
#define PRBS_IPVERSION_IPVERSION_DEFAULT     (_PRBS_IPVERSION_IPVERSION_DEFAULT << 0)   /**< Shifted mode DEFAULT for PRBS_IPVERSION     */

/* Bit fields for PRBS EN */
#define _PRBS_EN_RESETVALUE                  0x00000000UL                               /**< Default value for PRBS_EN                   */
#define _PRBS_EN_MASK                        0x00000003UL                               /**< Mask for PRBS_EN                            */
#define PRBS_EN_EN                           (0x1UL << 0)                               /**< Module Enable                               */
#define _PRBS_EN_EN_SHIFT                    0                                          /**< Shift value for PRBS_EN                     */
#define _PRBS_EN_EN_MASK                     0x1UL                                      /**< Bit mask for PRBS_EN                        */
#define _PRBS_EN_EN_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for PRBS_EN                    */
#define PRBS_EN_EN_DEFAULT                   (_PRBS_EN_EN_DEFAULT << 0)                 /**< Shifted mode DEFAULT for PRBS_EN            */
#define PRBS_EN_DISABLING                    (0x1UL << 1)                               /**< Disablement Busy Status                     */
#define _PRBS_EN_DISABLING_SHIFT             1                                          /**< Shift value for PRBS_DISABLING              */
#define _PRBS_EN_DISABLING_MASK              0x2UL                                      /**< Bit mask for PRBS_DISABLING                 */
#define _PRBS_EN_DISABLING_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_EN                    */
#define PRBS_EN_DISABLING_DEFAULT            (_PRBS_EN_DISABLING_DEFAULT << 1)          /**< Shifted mode DEFAULT for PRBS_EN            */

/* Bit fields for PRBS SWRST */
#define _PRBS_SWRST_RESETVALUE               0x00000000UL                               /**< Default value for PRBS_SWRST                */
#define _PRBS_SWRST_MASK                     0x00000003UL                               /**< Mask for PRBS_SWRST                         */
#define PRBS_SWRST_SWRST                     (0x1UL << 0)                               /**< Software Reset Command                      */
#define _PRBS_SWRST_SWRST_SHIFT              0                                          /**< Shift value for PRBS_SWRST                  */
#define _PRBS_SWRST_SWRST_MASK               0x1UL                                      /**< Bit mask for PRBS_SWRST                     */
#define _PRBS_SWRST_SWRST_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_SWRST                 */
#define PRBS_SWRST_SWRST_DEFAULT             (_PRBS_SWRST_SWRST_DEFAULT << 0)           /**< Shifted mode DEFAULT for PRBS_SWRST         */
#define PRBS_SWRST_RESETTING                 (0x1UL << 1)                               /**< Software Reset Busy Status                  */
#define _PRBS_SWRST_RESETTING_SHIFT          1                                          /**< Shift value for PRBS_RESETTING              */
#define _PRBS_SWRST_RESETTING_MASK           0x2UL                                      /**< Bit mask for PRBS_RESETTING                 */
#define _PRBS_SWRST_RESETTING_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for PRBS_SWRST                 */
#define PRBS_SWRST_RESETTING_DEFAULT         (_PRBS_SWRST_RESETTING_DEFAULT << 1)       /**< Shifted mode DEFAULT for PRBS_SWRST         */

/* Bit fields for PRBS CONNECT */
#define _PRBS_CONNECT_RESETVALUE             0x00000000UL                               /**< Default value for PRBS_CONNECT              */
#define _PRBS_CONNECT_MASK                   0x00000101UL                               /**< Mask for PRBS_CONNECT                       */
#define PRBS_CONNECT_IN                      (0x1UL << 0)                               /**< Input FIFO connect                          */
#define _PRBS_CONNECT_IN_SHIFT               0                                          /**< Shift value for PRBS_IN                     */
#define _PRBS_CONNECT_IN_MASK                0x1UL                                      /**< Bit mask for PRBS_IN                        */
#define _PRBS_CONNECT_IN_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_CONNECT               */
#define PRBS_CONNECT_IN_DEFAULT              (_PRBS_CONNECT_IN_DEFAULT << 0)            /**< Shifted mode DEFAULT for PRBS_CONNECT       */
#define PRBS_CONNECT_OUT                     (0x1UL << 8)                               /**< Output FIFO connect                         */
#define _PRBS_CONNECT_OUT_SHIFT              8                                          /**< Shift value for PRBS_OUT                    */
#define _PRBS_CONNECT_OUT_MASK               0x100UL                                    /**< Bit mask for PRBS_OUT                       */
#define _PRBS_CONNECT_OUT_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_CONNECT               */
#define PRBS_CONNECT_OUT_DEFAULT             (_PRBS_CONNECT_OUT_DEFAULT << 8)           /**< Shifted mode DEFAULT for PRBS_CONNECT       */

