SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prbs.h
/* Bit fields for PRBS DISCLK */
#define _PRBS_DISCLK_RESETVALUE              0x00000002UL                               /**< Default value for PRBS_DISCLK               */
#define _PRBS_DISCLK_MASK                    0x00000003UL                               /**< Mask for PRBS_DISCLK                        */
#define _PRBS_DISCLK_DISCLK_SHIFT            0                                          /**< Shift value for PRBS_DISCLK                 */
#define _PRBS_DISCLK_DISCLK_MASK             0x3UL                                      /**< Bit mask for PRBS_DISCLK                    */
#define _PRBS_DISCLK_DISCLK_DEFAULT          0x00000002UL                               /**< Mode DEFAULT for PRBS_DISCLK                */
#define _PRBS_DISCLK_DISCLK_NONE             0x00000000UL                               /**< Mode NONE for PRBS_DISCLK                   */
#define _PRBS_DISCLK_DISCLK_ALL              0x00000001UL                               /**< Mode ALL for PRBS_DISCLK                    */
#define _PRBS_DISCLK_DISCLK_AUTO             0x00000002UL                               /**< Mode AUTO for PRBS_DISCLK                   */
#define _PRBS_DISCLK_DISCLK_NOTUSED          0x00000003UL                               /**< Mode NOTUSED for PRBS_DISCLK                */
#define PRBS_DISCLK_DISCLK_DEFAULT           (_PRBS_DISCLK_DISCLK_DEFAULT << 0)         /**< Shifted mode DEFAULT for PRBS_DISCLK        */
#define PRBS_DISCLK_DISCLK_NONE              (_PRBS_DISCLK_DISCLK_NONE << 0)            /**< Shifted mode NONE for PRBS_DISCLK           */
#define PRBS_DISCLK_DISCLK_ALL               (_PRBS_DISCLK_DISCLK_ALL << 0)             /**< Shifted mode ALL for PRBS_DISCLK            */
#define PRBS_DISCLK_DISCLK_AUTO              (_PRBS_DISCLK_DISCLK_AUTO << 0)            /**< Shifted mode AUTO for PRBS_DISCLK           */
#define PRBS_DISCLK_DISCLK_NOTUSED           (_PRBS_DISCLK_DISCLK_NOTUSED << 0)         /**< Shifted mode NOTUSED for PRBS_DISCLK        */

/* Bit fields for PRBS FIFOIN */
#define _PRBS_FIFOIN_RESETVALUE              0x00000000UL                               /**< Default value for PRBS_FIFOIN               */
#define _PRBS_FIFOIN_MASK                    0x1FFF3F0FUL                               /**< Mask for PRBS_FIFOIN                        */
#define _PRBS_FIFOIN_FID_SHIFT               0                                          /**< Shift value for PRBS_FID                    */
#define _PRBS_FIFOIN_FID_MASK                0xFUL                                      /**< Bit mask for PRBS_FID                       */
#define _PRBS_FIFOIN_FID_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOIN                */
#define PRBS_FIFOIN_FID_DEFAULT              (_PRBS_FIFOIN_FID_DEFAULT << 0)            /**< Shifted mode DEFAULT for PRBS_FIFOIN        */
#define _PRBS_FIFOIN_CID_SHIFT               8                                          /**< Shift value for PRBS_CID                    */
#define _PRBS_FIFOIN_CID_MASK                0x3F00UL                                   /**< Bit mask for PRBS_CID                       */
#define _PRBS_FIFOIN_CID_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOIN                */
#define PRBS_FIFOIN_CID_DEFAULT              (_PRBS_FIFOIN_CID_DEFAULT << 8)            /**< Shifted mode DEFAULT for PRBS_FIFOIN        */
#define _PRBS_FIFOIN_REM_SHIFT               16                                         /**< Shift value for PRBS_REM                    */
#define _PRBS_FIFOIN_REM_MASK                0xFF0000UL                                 /**< Bit mask for PRBS_REM                       */
#define _PRBS_FIFOIN_REM_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOIN                */
#define PRBS_FIFOIN_REM_DEFAULT              (_PRBS_FIFOIN_REM_DEFAULT << 16)           /**< Shifted mode DEFAULT for PRBS_FIFOIN        */
#define _PRBS_FIFOIN_ALARM_SHIFT             24                                         /**< Shift value for PRBS_ALARM                  */
#define _PRBS_FIFOIN_ALARM_MASK              0x1F000000UL                               /**< Bit mask for PRBS_ALARM                     */
#define _PRBS_FIFOIN_ALARM_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOIN                */
#define PRBS_FIFOIN_ALARM_DEFAULT            (_PRBS_FIFOIN_ALARM_DEFAULT << 24)         /**< Shifted mode DEFAULT for PRBS_FIFOIN        */

/* Bit fields for PRBS FIFOOUT */
#define _PRBS_FIFOOUT_RESETVALUE             0x00000000UL                               /**< Default value for PRBS_FIFOOUT              */
#define _PRBS_FIFOOUT_MASK                   0x1FFF0000UL                               /**< Mask for PRBS_FIFOOUT                       */
#define _PRBS_FIFOOUT_CNT_SHIFT              16                                         /**< Shift value for PRBS_CNT                    */
#define _PRBS_FIFOOUT_CNT_MASK               0xFF0000UL                                 /**< Bit mask for PRBS_CNT                       */
#define _PRBS_FIFOOUT_CNT_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOOUT               */
#define PRBS_FIFOOUT_CNT_DEFAULT             (_PRBS_FIFOOUT_CNT_DEFAULT << 16)          /**< Shifted mode DEFAULT for PRBS_FIFOOUT       */
#define _PRBS_FIFOOUT_ALARM_SHIFT            24                                         /**< Shift value for PRBS_ALARM                  */
#define _PRBS_FIFOOUT_ALARM_MASK             0x1F000000UL                               /**< Bit mask for PRBS_ALARM                     */
#define _PRBS_FIFOOUT_ALARM_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for PRBS_FIFOOUT               */
#define PRBS_FIFOOUT_ALARM_DEFAULT           (_PRBS_FIFOOUT_ALARM_DEFAULT << 24)        /**< Shifted mode DEFAULT for PRBS_FIFOOUT       */

/* Bit fields for PRBS FMTIN */
#define _PRBS_FMTIN_RESETVALUE               0x0200001FUL                               /**< Default value for PRBS_FMTIN                */
#define _PRBS_FMTIN_MASK                     0x0303031FUL                               /**< Mask for PRBS_FMTIN                         */
#define _PRBS_FMTIN_ELEMSIZE_SHIFT           0                                          /**< Shift value for PRBS_ELEMSIZE               */
#define _PRBS_FMTIN_ELEMSIZE_MASK            0x1FUL                                     /**< Bit mask for PRBS_ELEMSIZE                  */
#define _PRBS_FMTIN_ELEMSIZE_DEFAULT         0x0000001FUL                               /**< Mode DEFAULT for PRBS_FMTIN                 */
#define PRBS_FMTIN_ELEMSIZE_DEFAULT          (_PRBS_FMTIN_ELEMSIZE_DEFAULT << 0)        /**< Shifted mode DEFAULT for PRBS_FMTIN         */
#define _PRBS_FMTIN_ELEMNB_SHIFT             8                                          /**< Shift value for PRBS_ELEMNB                 */
#define _PRBS_FMTIN_ELEMNB_MASK              0x300UL                                    /**< Bit mask for PRBS_ELEMNB                    */
#define _PRBS_FMTIN_ELEMNB_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_FMTIN                 */
#define _PRBS_FMTIN_ELEMNB_ONE               0x00000000UL                               /**< Mode ONE for PRBS_FMTIN                     */
#define _PRBS_FMTIN_ELEMNB_TWO               0x00000001UL                               /**< Mode TWO for PRBS_FMTIN                     */
#define _PRBS_FMTIN_ELEMNB_FOUR              0x00000002UL                               /**< Mode FOUR for PRBS_FMTIN                    */
#define PRBS_FMTIN_ELEMNB_DEFAULT            (_PRBS_FMTIN_ELEMNB_DEFAULT << 8)          /**< Shifted mode DEFAULT for PRBS_FMTIN         */
#define PRBS_FMTIN_ELEMNB_ONE                (_PRBS_FMTIN_ELEMNB_ONE << 8)              /**< Shifted mode ONE for PRBS_FMTIN             */
#define PRBS_FMTIN_ELEMNB_TWO                (_PRBS_FMTIN_ELEMNB_TWO << 8)              /**< Shifted mode TWO for PRBS_FMTIN             */
#define PRBS_FMTIN_ELEMNB_FOUR               (_PRBS_FMTIN_ELEMNB_FOUR << 8)             /**< Shifted mode FOUR for PRBS_FMTIN            */
#define _PRBS_FMTIN_ELEMALIGN_SHIFT          16                                         /**< Shift value for PRBS_ELEMALIGN              */
#define _PRBS_FMTIN_ELEMALIGN_MASK           0x30000UL                                  /**< Bit mask for PRBS_ELEMALIGN                 */
#define _PRBS_FMTIN_ELEMALIGN_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for PRBS_FMTIN                 */
#define _PRBS_FMTIN_ELEMALIGN_WORD           0x00000000UL                               /**< Mode WORD for PRBS_FMTIN                    */
#define _PRBS_FMTIN_ELEMALIGN_HALFWORD       0x00000001UL                               /**< Mode HALFWORD for PRBS_FMTIN                */
#define _PRBS_FMTIN_ELEMALIGN_BYTE           0x00000002UL                               /**< Mode BYTE for PRBS_FMTIN                    */
#define PRBS_FMTIN_ELEMALIGN_DEFAULT         (_PRBS_FMTIN_ELEMALIGN_DEFAULT << 16)      /**< Shifted mode DEFAULT for PRBS_FMTIN         */
#define PRBS_FMTIN_ELEMALIGN_WORD            (_PRBS_FMTIN_ELEMALIGN_WORD << 16)         /**< Shifted mode WORD for PRBS_FMTIN            */
#define PRBS_FMTIN_ELEMALIGN_HALFWORD        (_PRBS_FMTIN_ELEMALIGN_HALFWORD << 16)     /**< Shifted mode HALFWORD for PRBS_FMTIN        */
#define PRBS_FMTIN_ELEMALIGN_BYTE            (_PRBS_FMTIN_ELEMALIGN_BYTE << 16)         /**< Shifted mode BYTE for PRBS_FMTIN            */
#define _PRBS_FMTIN_ELEMTYPE_SHIFT           24                                         /**< Shift value for PRBS_ELEMTYPE               */
#define _PRBS_FMTIN_ELEMTYPE_MASK            0x3000000UL                                /**< Bit mask for PRBS_ELEMTYPE                  */
#define _PRBS_FMTIN_ELEMTYPE_DEFAULT         0x00000002UL                               /**< Mode DEFAULT for PRBS_FMTIN                 */
#define _PRBS_FMTIN_ELEMTYPE_COMPLEX         0x00000000UL                               /**< Mode COMPLEX for PRBS_FMTIN                 */
#define _PRBS_FMTIN_ELEMTYPE_INTEGER         0x00000001UL                               /**< Mode INTEGER for PRBS_FMTIN                 */
#define _PRBS_FMTIN_ELEMTYPE_LOGIC           0x00000002UL                               /**< Mode LOGIC for PRBS_FMTIN                   */
#define PRBS_FMTIN_ELEMTYPE_DEFAULT          (_PRBS_FMTIN_ELEMTYPE_DEFAULT << 24)       /**< Shifted mode DEFAULT for PRBS_FMTIN         */
#define PRBS_FMTIN_ELEMTYPE_COMPLEX          (_PRBS_FMTIN_ELEMTYPE_COMPLEX << 24)       /**< Shifted mode COMPLEX for PRBS_FMTIN         */
#define PRBS_FMTIN_ELEMTYPE_INTEGER          (_PRBS_FMTIN_ELEMTYPE_INTEGER << 24)       /**< Shifted mode INTEGER for PRBS_FMTIN         */
#define PRBS_FMTIN_ELEMTYPE_LOGIC            (_PRBS_FMTIN_ELEMTYPE_LOGIC << 24)         /**< Shifted mode LOGIC for PRBS_FMTIN           */

