SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prbs.h
/* Bit fields for PRBS CTRL1 */
#define _PRBS_CTRL1_RESETVALUE               0x00004000UL                               /**< Default value for PRBS_CTRL1                */
#define _PRBS_CTRL1_MASK                     0xFFFFC00FUL                               /**< Mask for PRBS_CTRL1                         */
#define PRBS_CTRL1_RST                       (0x1UL << 0)                               /**< New BitField                                */
#define _PRBS_CTRL1_RST_SHIFT                0                                          /**< Shift value for PRBS_RST                    */
#define _PRBS_CTRL1_RST_MASK                 0x1UL                                      /**< Bit mask for PRBS_RST                       */
#define _PRBS_CTRL1_RST_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define PRBS_CTRL1_RST_DEFAULT               (_PRBS_CTRL1_RST_DEFAULT << 0)             /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_START                     (0x1UL << 1)                               /**< New BitField                                */
#define _PRBS_CTRL1_START_SHIFT              1                                          /**< Shift value for PRBS_START                  */
#define _PRBS_CTRL1_START_MASK               0x2UL                                      /**< Bit mask for PRBS_START                     */
#define _PRBS_CTRL1_START_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_START_IDLE               0x00000000UL                               /**< Mode IDLE for PRBS_CTRL1                    */
#define _PRBS_CTRL1_START_RUN                0x00000001UL                               /**< Mode RUN for PRBS_CTRL1                     */
#define PRBS_CTRL1_START_DEFAULT             (_PRBS_CTRL1_START_DEFAULT << 1)           /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_START_IDLE                (_PRBS_CTRL1_START_IDLE << 1)              /**< Shifted mode IDLE for PRBS_CTRL1            */
#define PRBS_CTRL1_START_RUN                 (_PRBS_CTRL1_START_RUN << 1)               /**< Shifted mode RUN for PRBS_CTRL1             */
#define PRBS_CTRL1_CONT                      (0x1UL << 2)                               /**< New BitField                                */
#define _PRBS_CTRL1_CONT_SHIFT               2                                          /**< Shift value for PRBS_CONT                   */
#define _PRBS_CTRL1_CONT_MASK                0x4UL                                      /**< Bit mask for PRBS_CONT                      */
#define _PRBS_CTRL1_CONT_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_CONT_IDLE                0x00000000UL                               /**< Mode IDLE for PRBS_CTRL1                    */
#define _PRBS_CTRL1_CONT_RUN                 0x00000001UL                               /**< Mode RUN for PRBS_CTRL1                     */
#define PRBS_CTRL1_CONT_DEFAULT              (_PRBS_CTRL1_CONT_DEFAULT << 2)            /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_CONT_IDLE                 (_PRBS_CTRL1_CONT_IDLE << 2)               /**< Shifted mode IDLE for PRBS_CTRL1            */
#define PRBS_CTRL1_CONT_RUN                  (_PRBS_CTRL1_CONT_RUN << 2)                /**< Shifted mode RUN for PRBS_CTRL1             */
#define PRBS_CTRL1_ENREQOUT                  (0x1UL << 3)                               /**< New BitField                                */
#define _PRBS_CTRL1_ENREQOUT_SHIFT           3                                          /**< Shift value for PRBS_ENREQOUT               */
#define _PRBS_CTRL1_ENREQOUT_MASK            0x8UL                                      /**< Bit mask for PRBS_ENREQOUT                  */
#define _PRBS_CTRL1_ENREQOUT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_ENREQOUT_NO              0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_ENREQOUT_YES             0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_ENREQOUT_DEFAULT          (_PRBS_CTRL1_ENREQOUT_DEFAULT << 3)        /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_ENREQOUT_NO               (_PRBS_CTRL1_ENREQOUT_NO << 3)             /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_ENREQOUT_YES              (_PRBS_CTRL1_ENREQOUT_YES << 3)            /**< Shifted mode YES for PRBS_CTRL1             */
#define _PRBS_CTRL1_OUTSEL_SHIFT             14                                         /**< Shift value for PRBS_OUTSEL                 */
#define _PRBS_CTRL1_OUTSEL_MASK              0xC000UL                                   /**< Bit mask for PRBS_OUTSEL                    */
#define _PRBS_CTRL1_OUTSEL_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_OUTSEL_FEEDBACK          0x00000000UL                               /**< Mode FEEDBACK for PRBS_CTRL1                */
#define _PRBS_CTRL1_OUTSEL_IDX               0x00000001UL                               /**< Mode IDX for PRBS_CTRL1                     */
#define _PRBS_CTRL1_OUTSEL_FEEDSEL           0x00000002UL                               /**< Mode FEEDSEL for PRBS_CTRL1                 */
#define PRBS_CTRL1_OUTSEL_DEFAULT            (_PRBS_CTRL1_OUTSEL_DEFAULT << 14)         /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_OUTSEL_FEEDBACK           (_PRBS_CTRL1_OUTSEL_FEEDBACK << 14)        /**< Shifted mode FEEDBACK for PRBS_CTRL1        */
#define PRBS_CTRL1_OUTSEL_IDX                (_PRBS_CTRL1_OUTSEL_IDX << 14)             /**< Shifted mode IDX for PRBS_CTRL1             */
#define PRBS_CTRL1_OUTSEL_FEEDSEL            (_PRBS_CTRL1_OUTSEL_FEEDSEL << 14)         /**< Shifted mode FEEDSEL for PRBS_CTRL1         */
#define PRBS_CTRL1_INV                       (0x1UL << 16)                              /**< New BitField                                */
#define _PRBS_CTRL1_INV_SHIFT                16                                         /**< Shift value for PRBS_INV                    */
#define _PRBS_CTRL1_INV_MASK                 0x10000UL                                  /**< Bit mask for PRBS_INV                       */
#define _PRBS_CTRL1_INV_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_INV_NO                   0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_INV_YES                  0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_INV_DEFAULT               (_PRBS_CTRL1_INV_DEFAULT << 16)            /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_INV_NO                    (_PRBS_CTRL1_INV_NO << 16)                 /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_INV_YES                   (_PRBS_CTRL1_INV_YES << 16)                /**< Shifted mode YES for PRBS_CTRL1             */
#define _PRBS_CTRL1_INSEL_SHIFT              17                                         /**< Shift value for PRBS_INSEL                  */
#define _PRBS_CTRL1_INSEL_MASK               0x60000UL                                  /**< Bit mask for PRBS_INSEL                     */
#define _PRBS_CTRL1_INSEL_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_INSEL_PRBSOUT            0x00000000UL                               /**< Mode PRBSOUT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_INSEL_INPUT              0x00000001UL                               /**< Mode INPUT for PRBS_CTRL1                   */
#define _PRBS_CTRL1_INSEL_PRBSXORINPUT       0x00000002UL                               /**< Mode PRBSXORINPUT for PRBS_CTRL1            */
#define _PRBS_CTRL1_INSEL_NOTUSED            0x00000003UL                               /**< Mode NOTUSED for PRBS_CTRL1                 */
#define PRBS_CTRL1_INSEL_DEFAULT             (_PRBS_CTRL1_INSEL_DEFAULT << 17)          /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_INSEL_PRBSOUT             (_PRBS_CTRL1_INSEL_PRBSOUT << 17)          /**< Shifted mode PRBSOUT for PRBS_CTRL1         */
#define PRBS_CTRL1_INSEL_INPUT               (_PRBS_CTRL1_INSEL_INPUT << 17)            /**< Shifted mode INPUT for PRBS_CTRL1           */
#define PRBS_CTRL1_INSEL_PRBSXORINPUT        (_PRBS_CTRL1_INSEL_PRBSXORINPUT << 17)     /**< Shifted mode PRBSXORINPUT for PRBS_CTRL1    */
#define PRBS_CTRL1_INSEL_NOTUSED             (_PRBS_CTRL1_INSEL_NOTUSED << 17)          /**< Shifted mode NOTUSED for PRBS_CTRL1         */
#define PRBS_CTRL1_USEINPUT                  (0x1UL << 19)                              /**< New BitField                                */
#define _PRBS_CTRL1_USEINPUT_SHIFT           19                                         /**< Shift value for PRBS_USEINPUT               */
#define _PRBS_CTRL1_USEINPUT_MASK            0x80000UL                                  /**< Bit mask for PRBS_USEINPUT                  */
#define _PRBS_CTRL1_USEINPUT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_USEINPUT_NO              0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_USEINPUT_YES             0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_USEINPUT_DEFAULT          (_PRBS_CTRL1_USEINPUT_DEFAULT << 19)       /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_USEINPUT_NO               (_PRBS_CTRL1_USEINPUT_NO << 19)            /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_USEINPUT_YES              (_PRBS_CTRL1_USEINPUT_YES << 19)           /**< Shifted mode YES for PRBS_CTRL1             */
#define PRBS_CTRL1_OUTINV                    (0x1UL << 20)                              /**< New BitField                                */
#define _PRBS_CTRL1_OUTINV_SHIFT             20                                         /**< Shift value for PRBS_OUTINV                 */
#define _PRBS_CTRL1_OUTINV_MASK              0x100000UL                                 /**< Bit mask for PRBS_OUTINV                    */
#define _PRBS_CTRL1_OUTINV_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_OUTINV_NO                0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_OUTINV_YES               0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_OUTINV_DEFAULT            (_PRBS_CTRL1_OUTINV_DEFAULT << 20)         /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_OUTINV_NO                 (_PRBS_CTRL1_OUTINV_NO << 20)              /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_OUTINV_YES                (_PRBS_CTRL1_OUTINV_YES << 20)             /**< Shifted mode YES for PRBS_CTRL1             */
#define PRBS_CTRL1_SWAP                      (0x1UL << 21)                              /**< New BitField                                */
#define _PRBS_CTRL1_SWAP_SHIFT               21                                         /**< Shift value for PRBS_SWAP                   */
#define _PRBS_CTRL1_SWAP_MASK                0x200000UL                                 /**< Bit mask for PRBS_SWAP                      */
#define _PRBS_CTRL1_SWAP_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_SWAP_NO                  0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_SWAP_YES                 0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_SWAP_DEFAULT              (_PRBS_CTRL1_SWAP_DEFAULT << 21)           /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_SWAP_NO                   (_PRBS_CTRL1_SWAP_NO << 21)                /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_SWAP_YES                  (_PRBS_CTRL1_SWAP_YES << 21)               /**< Shifted mode YES for PRBS_CTRL1             */
#define _PRBS_CTRL1_OUTIDX_SHIFT             22                                         /**< Shift value for PRBS_OUTIDX                 */
#define _PRBS_CTRL1_OUTIDX_MASK              0xFC00000UL                                /**< Bit mask for PRBS_OUTIDX                    */
#define _PRBS_CTRL1_OUTIDX_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define PRBS_CTRL1_OUTIDX_DEFAULT            (_PRBS_CTRL1_OUTIDX_DEFAULT << 22)         /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_SOFTBIT                   (0x1UL << 28)                              /**< New BitField                                */
#define _PRBS_CTRL1_SOFTBIT_SHIFT            28                                         /**< Shift value for PRBS_SOFTBIT                */
#define _PRBS_CTRL1_SOFTBIT_MASK             0x10000000UL                               /**< Bit mask for PRBS_SOFTBIT                   */
#define _PRBS_CTRL1_SOFTBIT_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_SOFTBIT_NO               0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_SOFTBIT_YES              0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_SOFTBIT_DEFAULT           (_PRBS_CTRL1_SOFTBIT_DEFAULT << 28)        /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_SOFTBIT_NO                (_PRBS_CTRL1_SOFTBIT_NO << 28)             /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_SOFTBIT_YES               (_PRBS_CTRL1_SOFTBIT_YES << 28)            /**< Shifted mode YES for PRBS_CTRL1             */
#define PRBS_CTRL1_SYNCSTAT                  (0x1UL << 29)                              /**< New BitField                                */
#define _PRBS_CTRL1_SYNCSTAT_SHIFT           29                                         /**< Shift value for PRBS_SYNCSTAT               */
#define _PRBS_CTRL1_SYNCSTAT_MASK            0x20000000UL                               /**< Bit mask for PRBS_SYNCSTAT                  */
#define _PRBS_CTRL1_SYNCSTAT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_SYNCSTAT_NO              0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_SYNCSTAT_YES             0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_SYNCSTAT_DEFAULT          (_PRBS_CTRL1_SYNCSTAT_DEFAULT << 29)       /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_SYNCSTAT_NO               (_PRBS_CTRL1_SYNCSTAT_NO << 29)            /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_SYNCSTAT_YES              (_PRBS_CTRL1_SYNCSTAT_YES << 29)           /**< Shifted mode YES for PRBS_CTRL1             */
#define PRBS_CTRL1_BYPASS                    (0x1UL << 30)                              /**< New BitField                                */
#define _PRBS_CTRL1_BYPASS_SHIFT             30                                         /**< Shift value for PRBS_BYPASS                 */
#define _PRBS_CTRL1_BYPASS_MASK              0x40000000UL                               /**< Bit mask for PRBS_BYPASS                    */
#define _PRBS_CTRL1_BYPASS_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_BYPASS_NO                0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_BYPASS_YES               0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_BYPASS_DEFAULT            (_PRBS_CTRL1_BYPASS_DEFAULT << 30)         /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_BYPASS_NO                 (_PRBS_CTRL1_BYPASS_NO << 30)              /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_BYPASS_YES                (_PRBS_CTRL1_BYPASS_YES << 30)             /**< Shifted mode YES for PRBS_CTRL1             */
#define PRBS_CTRL1_DEBUG                     (0x1UL << 31)                              /**< New BitField                                */
#define _PRBS_CTRL1_DEBUG_SHIFT              31                                         /**< Shift value for PRBS_DEBUG                  */
#define _PRBS_CTRL1_DEBUG_MASK               0x80000000UL                               /**< Bit mask for PRBS_DEBUG                     */
#define _PRBS_CTRL1_DEBUG_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for PRBS_CTRL1                 */
#define _PRBS_CTRL1_DEBUG_NO                 0x00000000UL                               /**< Mode NO for PRBS_CTRL1                      */
#define _PRBS_CTRL1_DEBUG_YES                0x00000001UL                               /**< Mode YES for PRBS_CTRL1                     */
#define PRBS_CTRL1_DEBUG_DEFAULT             (_PRBS_CTRL1_DEBUG_DEFAULT << 31)          /**< Shifted mode DEFAULT for PRBS_CTRL1         */
#define PRBS_CTRL1_DEBUG_NO                  (_PRBS_CTRL1_DEBUG_NO << 31)               /**< Shifted mode NO for PRBS_CTRL1              */
#define PRBS_CTRL1_DEBUG_YES                 (_PRBS_CTRL1_DEBUG_YES << 31)              /**< Shifted mode YES for PRBS_CTRL1             */

