SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prbs.h
/* Bit fields for PRBS INIT */
#define _PRBS_INIT_RESETVALUE                0x00000000UL                               /**< Default value for PRBS_INIT                 */
#define _PRBS_INIT_MASK                      0xFFFFFFFFUL                               /**< Mask for PRBS_INIT                          */
#define _PRBS_INIT_INIT_SHIFT                0                                          /**< Shift value for PRBS_INIT                   */
#define _PRBS_INIT_INIT_MASK                 0xFFFFFFFFUL                               /**< Bit mask for PRBS_INIT                      */
#define _PRBS_INIT_INIT_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PRBS_INIT                  */
#define PRBS_INIT_INIT_DEFAULT               (_PRBS_INIT_INIT_DEFAULT << 0)             /**< Shifted mode DEFAULT for PRBS_INIT          */

/* Bit fields for PRBS CTRL2 */
#define _PRBS_CTRL2_RESETVALUE               0x00830020UL                               /**< Default value for PRBS_CTRL2                */
#define _PRBS_CTRL2_MASK                     0xFFFFFFFFUL                               /**< Mask for PRBS_CTRL2                         */
#define _PRBS_CTRL2_NBITER_SHIFT             0                                          /**< Shift value for PRBS_NBITER                 */
#define _PRBS_CTRL2_NBITER_MASK              0xFFFFUL                                   /**< Bit mask for PRBS_NBITER                    */
#define _PRBS_CTRL2_NBITER_DEFAULT           0x00000020UL                               /**< Mode DEFAULT for PRBS_CTRL2                 */
#define PRBS_CTRL2_NBITER_DEFAULT            (_PRBS_CTRL2_NBITER_DEFAULT << 0)          /**< Shifted mode DEFAULT for PRBS_CTRL2         */
#define PRBS_CTRL2_SELCOMPLEMENT             (0x1UL << 16)                              /**< New BitField                                */
#define _PRBS_CTRL2_SELCOMPLEMENT_SHIFT      16                                         /**< Shift value for PRBS_SELCOMPLEMENT          */
#define _PRBS_CTRL2_SELCOMPLEMENT_MASK       0x10000UL                                  /**< Bit mask for PRBS_SELCOMPLEMENT             */
#define _PRBS_CTRL2_SELCOMPLEMENT_DEFAULT    0x00000001UL                               /**< Mode DEFAULT for PRBS_CTRL2                 */
#define _PRBS_CTRL2_SELCOMPLEMENT_CA1        0x00000000UL                               /**< Mode CA1 for PRBS_CTRL2                     */
#define _PRBS_CTRL2_SELCOMPLEMENT_CA2        0x00000001UL                               /**< Mode CA2 for PRBS_CTRL2                     */
#define PRBS_CTRL2_SELCOMPLEMENT_DEFAULT     (_PRBS_CTRL2_SELCOMPLEMENT_DEFAULT << 16)  /**< Shifted mode DEFAULT for PRBS_CTRL2         */
#define PRBS_CTRL2_SELCOMPLEMENT_CA1         (_PRBS_CTRL2_SELCOMPLEMENT_CA1 << 16)      /**< Shifted mode CA1 for PRBS_CTRL2             */
#define PRBS_CTRL2_SELCOMPLEMENT_CA2         (_PRBS_CTRL2_SELCOMPLEMENT_CA2 << 16)      /**< Shifted mode CA2 for PRBS_CTRL2             */
#define PRBS_CTRL2_SCRAMBLE                  (0x1UL << 17)                              /**< New BitField                                */
#define _PRBS_CTRL2_SCRAMBLE_SHIFT           17                                         /**< Shift value for PRBS_SCRAMBLE               */
#define _PRBS_CTRL2_SCRAMBLE_MASK            0x20000UL                                  /**< Bit mask for PRBS_SCRAMBLE                  */
#define _PRBS_CTRL2_SCRAMBLE_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for PRBS_CTRL2                 */
#define _PRBS_CTRL2_SCRAMBLE_NO              0x00000000UL                               /**< Mode NO for PRBS_CTRL2                      */
#define _PRBS_CTRL2_SCRAMBLE_YES             0x00000001UL                               /**< Mode YES for PRBS_CTRL2                     */
#define PRBS_CTRL2_SCRAMBLE_DEFAULT          (_PRBS_CTRL2_SCRAMBLE_DEFAULT << 17)       /**< Shifted mode DEFAULT for PRBS_CTRL2         */
#define PRBS_CTRL2_SCRAMBLE_NO               (_PRBS_CTRL2_SCRAMBLE_NO << 17)            /**< Shifted mode NO for PRBS_CTRL2              */
#define PRBS_CTRL2_SCRAMBLE_YES              (_PRBS_CTRL2_SCRAMBLE_YES << 17)           /**< Shifted mode YES for PRBS_CTRL2             */
#define _PRBS_CTRL2_BDEPERIOD_SHIFT          18                                         /**< Shift value for PRBS_BDEPERIOD              */
#define _PRBS_CTRL2_BDEPERIOD_MASK           0xFFFC0000UL                               /**< Bit mask for PRBS_BDEPERIOD                 */
#define _PRBS_CTRL2_BDEPERIOD_DEFAULT        0x00000020UL                               /**< Mode DEFAULT for PRBS_CTRL2                 */
#define PRBS_CTRL2_BDEPERIOD_DEFAULT         (_PRBS_CTRL2_BDEPERIOD_DEFAULT << 18)      /**< Shifted mode DEFAULT for PRBS_CTRL2         */

/* Bit fields for PRBS STAT */
#define _PRBS_STAT_RESETVALUE                0x00000000UL                               /**< Default value for PRBS_STAT                 */
#define _PRBS_STAT_MASK                      0xFFFFFFFFUL                               /**< Mask for PRBS_STAT                          */
#define _PRBS_STAT_RES_SHIFT                 0                                          /**< Shift value for PRBS_RES                    */
#define _PRBS_STAT_RES_MASK                  0xFFFFFFFFUL                               /**< Bit mask for PRBS_RES                       */
#define _PRBS_STAT_RES_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for PRBS_STAT                  */
#define PRBS_STAT_RES_DEFAULT                (_PRBS_STAT_RES_DEFAULT << 0)              /**< Shifted mode DEFAULT for PRBS_STAT          */

/* Bit fields for PRBS SEQ */
#define _PRBS_SEQ_RESETVALUE                 0x00000000UL                               /**< Default value for PRBS_SEQ                  */
#define _PRBS_SEQ_MASK                       0xFFFFFFFFUL                               /**< Mask for PRBS_SEQ                           */
#define _PRBS_SEQ_SEQ_SHIFT                  0                                          /**< Shift value for PRBS_SEQ                    */
#define _PRBS_SEQ_SEQ_MASK                   0xFFFFFFFFUL                               /**< Bit mask for PRBS_SEQ                       */
#define _PRBS_SEQ_SEQ_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for PRBS_SEQ                   */
#define PRBS_SEQ_SEQ_DEFAULT                 (_PRBS_SEQ_SEQ_DEFAULT << 0)               /**< Shifted mode DEFAULT for PRBS_SEQ           */

/* Bit fields for PRBS POLY */
#define _PRBS_POLY_RESETVALUE                0x00000000UL                               /**< Default value for PRBS_POLY                 */
#define _PRBS_POLY_MASK                      0xFFFFFFFFUL                               /**< Mask for PRBS_POLY                          */
#define _PRBS_POLY_POLY_SHIFT                0                                          /**< Shift value for PRBS_POLY                   */
#define _PRBS_POLY_POLY_MASK                 0xFFFFFFFFUL                               /**< Bit mask for PRBS_POLY                      */
#define _PRBS_POLY_POLY_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PRBS_POLY                  */
#define PRBS_POLY_POLY_DEFAULT               (_PRBS_POLY_POLY_DEFAULT << 0)             /**< Shifted mode DEFAULT for PRBS_POLY          */

/* Bit fields for PRBS FEED */
#define _PRBS_FEED_RESETVALUE                0x00000000UL                               /**< Default value for PRBS_FEED                 */
#define _PRBS_FEED_MASK                      0xFFFFFFFFUL                               /**< Mask for PRBS_FEED                          */
#define _PRBS_FEED_FEED_SHIFT                0                                          /**< Shift value for PRBS_FEED                   */
#define _PRBS_FEED_FEED_MASK                 0xFFFFFFFFUL                               /**< Bit mask for PRBS_FEED                      */
#define _PRBS_FEED_FEED_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PRBS_FEED                  */
#define PRBS_FEED_FEED_DEFAULT               (_PRBS_FEED_FEED_DEFAULT << 0)             /**< Shifted mode DEFAULT for PRBS_FEED          */

/** @} End of group EFR32FG25_PRBS_BitFields */
/** @} End of group EFR32FG25_PRBS */
/** @} End of group Parts */

#endif /* EFR32FG25_PRBS_H */
